# -*- coding: utf-8 -*-

# Создать модуль my_burger. В нем определить функции добавления инградиентов:
#  - булочки
#  - котлеты
#  - огурчика
#  - помидорчика
#  - майонеза
#  - сыра
# В каждой функции выводить на консоль что-то вроде "А теперь добавим ..."

# В этом модуле создать рецепт двойного чизбургера (https://goo.gl/zA3goZ)
# с помощью фукций из my_burger и вывести на консоль.

# Создать рецепт своего бургера, по вашему вкусу.
# Если не хватает инградиентов - создать соответствующие функции в модуле my_burger

import my_burger

print('Рецепт бургера:')
my_burger.add_bread_bottom()
my_burger.add_beefsteak()
my_burger.add_cucumber()
my_burger.add_tomato()
my_burger.add_onion()
my_burger.add_cheese()
my_burger.add_bread_top()
print('Бургер готов! Пойду поем!')

# зачёт!
