# Создать модуль my_burger. В нем определить функции добавления инградиентов:
#  - булочки
#  - котлеты
#  - огурчика
#  - помидорчика
#  - майонеза
#  - сыра
# В каждой функции выводить на консоль что-то вроде "А теперь добавим ..."

def add_bread_bottom():
    print('Берём поджаристую булочку')


def add_bread_top():
    print('Накрываем сверху булочкой')


def add_beefsteak():
    print('Ещё добавим котлету')


def add_cucumber():
    print('Сверху добавим маринованные огурецы')


def add_tomato():
    print('Добавим ещё помидор')


def add_sauce():
    print('А теперь добавим горчичный соус ')


def add_cheese():
    print('И много плавленого сыр Чеддер')


def add_onion():
    print('А теперь добавим репчатый лук')
